app/controllers/users_controller.rb

  def update
    userId = params[:id]
    curUser = User.find_by_id(userId)

    if curUser
      curUser.wishlist = params[:wishlist]
      curUser.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "wishlist" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["wishlist", "I want this and that and this and that"], ["updated_at", "2015-12-15 10:11:54.206151"], ["id", 1]]